# Taps
tap 'homebrew/cask'
tap 'homebrew/cask-versions'
tap 'homebrew/bundle'
tap 'homebrew/cask-fonts'

# Binaries
brew 'awscli'
brew 'bash' # Latest Bash version
brew 'coreutils' # Those that come with macOS are outdated
brew 'colima'
brew 'docker'
brew 'docker-compose'
brew 'gh'
brew 'git'
brew 'gitmoji'
brew 'go'
brew 'mackup'
brew 'neovim'
brew 'openssh'
brew 'pnpm'
brew 'pyenv' # Python version manager
brew 'rustup'
brew 'starship'
brew 'trash'
brew 'wget'
brew 'yarn'
brew 'z'


# Apps
cask '1password'
cask 'affinity-designer'
cask 'affinity-photo'
cask 'alacritty'
cask 'cron'
cask 'enpass'
cask 'font-hack-nerd-font'
cask 'insomnia'
cask 'mongodb-compass'
cask 'nordvpn'
cask 'notion'
cask 'session-manager-plugin'
cask 'slack'
cask 'spectacle'
cask 'spotify'
cask 'tableplus'
cask 'the-unarchiver'
cask 'vanilla'
cask 'visual-studio-code'
cask 'vlc'
